Revit 2024 API
BuiltInFailures.CreationFailures.CannotCreateGutterWarn Property
 Could not create Gutter. [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateGutterWarn { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateGutterWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateGutterWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace